cool/tutorials/compressible/rhoCentralFoam/biconic25-55Run35/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat       raw;

surfaceFormat   vtk;

sets
(
    cone25
    {
        type    face;
        axis    x;
        start   ( 0 0 0 );
        end     ( 0.09208087 0.042939 0 );
        nPoints 92;
    }
    cone55
    {
        type    face;
        axis    x;
        start   ( 0.09208087 0.042939 0 );
        end     ( 0.153683 0.13092 0 );
        nPoints 61;
    }
    base
    {
        type    face;
        axis    x;
        start   ( 0.153683 0.13092 0 );
        end     ( 0.193675 0.13092 0 );
        nPoints 40;
    }
);

surfaces        ( );

fields          ( p wallHeatTransRate );

// ************************************************************************* //
